In [4]:
import pandas as pd
import numpy as np

In [6]:
df=pd.read_csv("C:\\Users\\HP\\DSBDA Assignments\\Datasets\\Salary_Data.csv")

In [7]:
np.mean(df['Roll No'])

KeyError: 'Roll No'

In [8]:
df.groupby(['Age']).count()

       YearsExperience  Salary
Age
18-22                3       3
23-25                9       9
26-28                7       7
29-31                4       4
32-34                3       3
35-37                3       3
38-40                1       1

In [9]:
df.groupby(['Age'])['Salary'].describe()

,count,mean,std,min,25%,50%,75%,max
Age,,,,,,,,
18-22,3.0,41093.000000,4499.893777,37731.0,38537.0,39343.0,42774.00,46205.0
23-25,9.0,56382.555556,9362.212414,39891.0,54445.0,57189.0,63218.00,67938.0
26-28,7.0,65917.571429,11671.646269,55794.0,57019.0,61111.0,73696.00,83088.0
29-31,4.0,96313.250000,4293.152484,91738.0,93389.5,96106.5,99030.25,101302.0
32-34,3.0,109608.333333,4117.864778,105582.0,107506.5,109431.0,111621.50,113812.0
35-37,3.0,117331.666667,4888.100790,112635.0,114802.0,116969.0,119680.00,122391.0
38-40,1.0,121872.000000,NaN,121872.0,121872.0,121872.0,121872.00,121872.0

In [10]:
df.groupby(['Age']).mean()

       YearsExperience         Salary
Age
18-22         1.300000   41093.000000
23-25         3.222222   56382.555556
26-28         4.700000   65917.571429
29-31         6.950000   96313.250000
32-34         8.633333  109608.333333
35-37         9.800000  117331.666667
38-40        10.500000  121872.000000

In [12]:
np.percentile(df['Salary'],25)

56720.75

In [15]:
df=pd.read_csv("C:\\Users\\HP\\DSBDA Assignments\\iris_3.csv")

In [17]:
df['sepal_length'].mean()

5.843333333333335

In [1]:
import pandas as pd

# Assuming you have a DataFrame named 'data' with columns 'Category' and 'Value'
data = pd.DataFrame({'Category': ['A', 'B', 'A', 'B', 'C', 'A'],
                     'Value': [10, 15, 8, 12, 9, 14]})

# Grouping the 'Value' variable by 'Category' and calculating summary statistics
summary_stats = data.groupby('Category')['Value'].describe()

# Creating a list of numeric values for each response to the categorical variable
numeric_values = summary_stats['mean'].tolist()

# Printing the list of numeric values
print(summary_stats)

          count       mean      std   min    25%   50%    75%   max
Category
A           3.0  10.666667  3.05505   8.0   9.00  10.0  12.00  14.0
B           2.0  13.500000  2.12132  12.0  12.75  13.5  14.25  15.0
C           1.0   9.000000      NaN   9.0   9.00   9.0   9.00   9.0